print("Здравствуй пользователь!!!=)\n")

nameUser = input("Представтесь пожалуйста: ")

print("\nДобро пожаловать " + nameUser +
      " в программу.\n" +
      "Мы Вам очень рады =)\n")

ageUser = input("Сколько Вам лет, " + nameUser +
                "?: ")

cityUser = input("\nИз какого Вы города, " + nameUser +
                 "?: ")

print("\nБлагодарю за беседу =) Очень приятно я провёл с Вами время\n\n")

print("*"*20 + "\n")
print("Техническая информация (введённые данные):\n")
print("ИМЯ пользователя: " + nameUser + "\n")
print("Лет пользователю: " + ageUser + "\n")
print("Город пользователя " + cityUser + "\n")
print("*"*20 + "\n\n")

input("Для закрытия программы нажмите любую клавишу...")